package lesson06_array;

public class Exer {
	public static void main(String[] args) {
		//1 모두의 마블
		//주사위 굴린 값의 합을 이용하여 이동한 거리를 계산
		//주사위 값이 서로 같을 경우 한번 더 굴립니다.
		//총 이동한 거리는 얼마일지 계산하여 출력합니다.
		//주사위를 몇 번 굴렸는지도 알면 좋을 듯 합니다.
		//math.random 해가지고 하면 될듯.
		
		//2 입력받은 두 수의 합계를 구하기
		//숫자 두 개를 입력받아서 (정수) 3과 10; 일 경우에는 4부터 9까지의 합을 구하세요.
		//입력 받은 수 중에 큰 수에서 작은 수를 뺀 값만큼 작은 수의 값+1에서 오름차순으로 for 문 이용해서
		//합계 만들면 될듯.
		
		//3 최대공약수
		//2중 for 문을 이용해서 구하는걸로. 자연수 두개. 입력 아니어두 됨.
		//약수 구하는 것부터 한 담에 찬찬히 해보자. 
		//선생님 말씀으론 본인보다 작은 수의 나머지연산 후
		//일치여부를 묻는 식으로 하면 약수를 구하는 것. 
		
		//4 소수 여부 확인
		//3번 문제와 크게 다름이 없음. 약수가 1과 자신만 존재해야 함.
		//(자신보다 작은 자연수의 집합)
		//ex) 10을 입력받으면 ~ 소수가 아닙니다.
		
		//5 회문수 여부 구하기
		// 숫자를 역순으로 뒤집어도 원래 숫자와 같은 거
		// 숫자 뒤집기는 나누기 연산으로 쉽게 가능하니
		
		//6 피보나치 수열?
	}
}
